Repository: mautic/user-documentation
Catalog: docs/locale/*/LC_MESSAGES/authentication/authentication.po
Languages: pt_br

source: Authentication
pt_br: Autenticação

source: Mautic uses basic authentication for Users, however there is the ability to integrate with a SAML SSO - Single Sign-On - provider.
pt_br: O Mautic utiliza autenticação básica para Usuários, porém existe a possibilidade de integração com um provedor SAML SSO - Single Sign-On.

source: SAML is a single sign on protocol that allows single sign on and User creation in Mautic using a third party User source called an identity provider (IDP).
pt_br: SAML é um protocolo de assinatura única que permite login único e criação de Usuário no Mautic usando uma fonte terceira Origem do Usuário chamada provedor de identidade (IDP).

source: Turning on SAML
pt_br: Ativando o SAML

source: To turn on SAML support in Mautic, you first need the IDP's metadata XML which they provide. If it's a URL, browse to the URL then save the content into an XML file.
pt_br: Para ativar o suporte a SAML no Mautic, primeiro você precisa do XML de metadados do IDP que eles fornecem. Se for uma URL, navegue até a URL e salve o conteúdo em um arquivo XML.

source: Click the settings wheel in the top right corner to open the **Settings** menu.
pt_br: Clique no ícone de configurações no canto superior direito para abrir o menu **Configurações**.

source: Navigate to **Configuration** > **User/Authentication** Settings.
pt_br: Navegue até **Configuração** > Configurações de **Usuário/Autenticação**.

source: Screenshot of SAML SSO Settings
pt_br: Captura de tela das configurações de SAML SSO

source: Upload this file as the Identity Provider Metadata file.
pt_br: Carregue este arquivo como o arquivo de Metadados do Provedor de Identidade.

source: It's recommended to create a non-Admin Role as the default Role for created Users. Select this Role in the '**Default Role for created Users**' dropdown. For more information, see :doc:`Users and Roles</users_roles/managing_users>`.
pt_br: É recomendável criar uma função não administrativa como a Função padrão para os Usuários criados. Selecione esta Função no menu suspenso '**Função Padrão para Usuários criados**'. Para mais informações, veja :doc:`Usuários e Funções</users_roles/managing_users>`.

source: Screenshot of the User Role Permission
pt_br: Captura de tela da Permissão de Função do Usuário

source: Configuring the IDP
pt_br: Configurando o IDP

source: The IDP may ask for the following settings:
pt_br: O IDP pode solicitar as seguintes configurações:

source: Entity ID - this is site URL, displayed at the top of User/Authentication Settings. Copy this exactly 'as is' to the IDP.
pt_br: ID da Entidade - este é o URL do site, exibido na parte superior das configurações de usuário/autenticação. Copie isso exatamente 'como está' para o IDP.

source: Service Provider Metadata - if the provider requires a URL, use ``https://example.com/saml/metadata.xml``. To use as a file rather than a URL, browse to that URL and save the content as an XML file.
pt_br: Metadados do Provedor de Serviços - se o provedor exigir uma URL, use ``https://exemplo.com.br/saml/metadata.xml``. Para usar como um arquivo em vez de um URL, navegue até esse URL e salve o conteúdo como um arquivo XML.

source: Assertion Consumer Service - Use ``https://example.com/s/saml/login_check``.
pt_br: Assertion Consumer Service - Use ``https://exemplo.com.br/s/saml/login_check``.

source: Issuer - this should come from the IDP but is often configurable. If it's a URL, be sure that the scheme - ``http://`` and ``https://`` - aren't part of it.
pt_br: Emissor - deve vir do IDP, mas geralmente é configurável. Se for uma URL, certifique-se de que o esquema - ``http://`` e ``https://`` - não faz parte dela.

source: Verify request signatures or a SSL certificate - If the IDP supports encrypting and validating request signatures from Mautic to the IDP, generate a self signed SSL certificate. Upload the certificate and private key through Mautic's Configuration > User/Authentication Settings under the 'Use a custom X.509 certificate and private key to secure communication between Mautic and the IDP' section. Then upload the certificate to the IDP.
pt_br: Verifique as assinaturas de solicitação ou um certificado SSL - Se o IDP oferecer suporte à criptografia e validação de assinaturas de solicitação do Mautic para o IDP, gere um certificado SSL auto assinado. Carregue o certificado e a chave privada através de Configuração do Mautic > Configurações de autenticação/usuário na seção 'Usar um certificado X.509 personalizado e chave privada para proteger a comunicação entre o Mautic e o IDP'. Em seguida, carregue o certificado no IDP.

source: Custom attributes - Mautic requires three custom attributes in the IDP responses for the User Email, first name and last name. Username is also supported but is optional. Configure the attribute names used by the IDP in Mautic's Configuration > User/Authentication Settings under the 'Enter the names of the attributes the configured IDP uses for the following Mautic User fields' section.
pt_br: Atributos personalizados - O Mautic requer três atributos personalizados nas respostas IDP para o e-mail do usuário, nome e sobrenome. O nome de usuário também é suportado, mas é opcional. Configure os nomes dos atributos usados pelo IDP nas Configurações > Configurações de Usuário/Autenticação na seção 'Entre com os nomes dos atributos de usos IDP configurados para seguir campos de usuários Mautic'.

source: Logging in
pt_br: Fazendo login

source: Once configured with the IDP and the IDP with Mautic, Mautic redirects all logins to the IDP's login. ``/s/login`` is still available for direct logins but you have to access it directly.
pt_br: Uma vez configurado com o IDP e o IDP com Mautic, o Mautic redireciona todos os logins para o login do IDP. ``/s/login`` ainda está disponível para logins diretos, mas você deve acessá-lo diretamente.

source: Login to the IDP, which then redirects you back to Mautic. If the exchange is successful Mautic creates a User if it doesn't already exist, and logs the User into the system.
pt_br: Faça login no IDP, que o redirecionará de volta ao Mautic. Se a troca for bem-sucedida, o Mautic cria um usuário, caso ainda não exista, e registra o usuário no sistema.

source: Turning off SAML
pt_br: Desativando o SAML

source: To turn off SAML, click the Remove link to the right of the Identity provider metadata file label.
pt_br: Para desativar o SAML, clique no link Remover à direita do rótulo do arquivo de metadados do provedor de identidade.

source: Screenshot of the authentication settings section
pt_br: Captura de tela da seção de configurações de autenticação
