Repository: mautic/user-documentation
Catalog: docs/locale_bk/*/LC_MESSAGES/categories/categories.po
Languages: pt_br

source: Categories
pt_br: Categorias

source: Categories are a way to organize Mautic elements. They're available for Assets, Campaigns, Emails, Focus Items, Forms, Pages, Points, Social Monitoring and Stages. There are two ways to use Categories:
pt_br: As categorias são uma forma de organizar os elementos do Mautic. Estão disponíveis para Ativos, Campanhas, Emails, Itens de Focus, Formulários, Landing Pages, Pontos, Monitoramento Social e Estágios. Há duas maneiras de usar Categorias:

source: Create element-specific Categories for example only for Assets, Emails or Forms.
pt_br: Crie categorias específicas de elementos, por exemplo, apenas para Ativos, E-mails ou Formulários.

source: Create global Categories for all Mautic elements.
pt_br: Crie categorias globais para todos os elementos do Mautic.

source: Creating and managing Categories
pt_br: Criando e gerenciando Categorias

source: To create new Categories, go to settings menu in the top right corner of Mautic. There choose Categories.
pt_br: Para criar novas Categorias, vá para o menu de configurações no canto superior direito do Mautic. Lá, selecione Categorias.

source: Screenshot of create new Category
pt_br: Captura de tela da criação de uma nova Categoria

source: When creating a new Category you can select type, title, description, alias, color and published status. The color will be helpful to quickly find Mautic elements by their appropriate Category when viewing things like the Calendar or other areas within Mautic.
pt_br: Ao criar uma nova Categoria, você pode selecionar tipo, título, descrição, pseudônimo, cor e status publicado (sim ou não). A cor será útil para encontrar rapidamente os elementos do Mautic por sua Categoria apropriada ao visualizar coisas como o Calendário ou outras áreas dentro do Mautic.

source: Using Categories for Contacts
pt_br: Usando Categorias para Contatos

source: In addition to organizing various Mautic elements Categories can be used to organize Contacts. In Contact details use the Preference menu to open Contact Preference Center.
pt_br: Além de organizar vários elementos do Mautic, as Categorias podem ser usadas para organizar os Contatos. Em Detalhes do contato, use o menu Preferências para abrir o Centro de Preferências do Contato.

source: Screenshot of assigning Category to Contact
pt_br: Captura de tela da atribuição de Categoria ao Contato

source: Contact Categories can be used in Segment and dynamic content filters.
pt_br: As Categorias de Contato podem ser usadas em filtros de conteúdo dinâmico e de Segmento.
